/*
 *	file: gvar_mem.h
 *	description: gloable variable memory init and uninit
 *	history: dongliqiang created at 20120227
 */

#ifndef __GVAR_MEM_H__
#define __GVAR_MEM_H__

#define PRESET_MAX_NUM  93

#define MEM_LEN_MINI   16
#define MEM_LEN_M      32
#define MEM_LEN_MIN    64
#define MEM_LEN_MID    128
#define MEM_LEN_MAX    1024
#define MEM_LEN_HUGE   2048

/**************************************************
*功能:		检测临时分配的内存pTmpMem是否分配成功
*参数:		_ppTmpMem:		临时内存指针
			_iNum:			内存指针个数
*返回值:	0: 成功, !0: 失败
*修改历史:
	20120228 v1.0 creat by pangtb
	2013.12.19 modified by qiaohaijun
**************************************************/
int CheckMem(void **_ppTmpMem, int _iNum, int MemSize);

/**************************************************
*功能:		释放所有分配的内存
*参数:		_ppTmpMem:		内存地址
			__iNum:			内存指针个数
*返回值:	0: 成功, !0: 失败
*修改历史:
	20120228 v1.0 creat by pangtb
**************************************************/
int FreeAllTmpMem(void **_ppTmpMem, int _iNum);


/******************************************************************************\
 *                                                                            *
 * globe members memory init                                                  *
 *                                                                            *
\******************************************************************************/
/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns1__Hello(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns1__Bye(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns10__Renew(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns10__Unsubscribe(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns10__PauseSubscription(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns10__ResumeSubscription(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns11__GetSupportedRules(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns11__CreateRules(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns11__DeleteRules(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns11__GetRules(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns11__ModifyRules(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns12__GetServiceCapabilities(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns12__GetSupportedAnalyticsModules(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns12__CreateAnalyticsModules(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns12__DeleteAnalyticsModules(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns12__GetAnalyticsModules(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns12__ModifyAnalyticsModules(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns2__Probe(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns3__PullMessages(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns3__SetSynchronizationPoint(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns4__GetServiceCapabilities(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns4__CreatePullPointSubscription(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns4__GetEventProperties(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns5__Renew(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns5__Unsubscribe(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns6__Subscribe(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns6__GetCurrentMessage(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns7__Notify(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns8__GetMessages(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns8__DestroyPullPoint(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns8__Notify(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__ns9__CreatePullPoint(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetServices(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetServiceCapabilities(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetDeviceInformation(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetSystemDateAndTime(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetSystemDateAndTime(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetSystemFactoryDefault(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__UpgradeSystemFirmware(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SystemReboot(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__RestoreSystem(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetSystemBackup(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetSystemLog(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetSystemSupportInformation(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetScopes(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetScopes(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__AddScopes(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__RemoveScopes(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetDiscoveryMode(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetDiscoveryMode(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetRemoteDiscoveryMode(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetRemoteDiscoveryMode(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetDPAddresses(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetEndpointReference(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetRemoteUser(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetRemoteUser(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetUsers(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__CreateUsers(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__DeleteUsers(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetUser(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetWsdlUrl(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetCapabilities(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetDPAddresses(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetHostname(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetHostname(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetHostnameFromDHCP(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetDNS(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetDNS(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetNTP(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetNTP(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetDynamicDNS(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetDynamicDNS(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetNetworkInterfaces(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetNetworkInterfaces(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetNetworkProtocols(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetNetworkProtocols(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetNetworkDefaultGateway(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetNetworkDefaultGateway(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetZeroConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetZeroConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetIPAddressFilter(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetIPAddressFilter(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__AddIPAddressFilter(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__RemoveIPAddressFilter(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetAccessPolicy(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetAccessPolicy(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__CreateCertificate(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetCertificates(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetCertificatesStatus(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetCertificatesStatus(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__DeleteCertificates(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetPkcs10Request(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__LoadCertificates(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetClientCertificateMode(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetClientCertificateMode(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetRelayOutputs(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetRelayOutputSettings(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetRelayOutputState(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SendAuxiliaryCommand(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetCACertificates(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__LoadCertificateWithPrivateKey(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetCertificateInformation(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__LoadCACertificates(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__CreateDot1XConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetDot1XConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetDot1XConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetDot1XConfigurations(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__DeleteDot1XConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetDot11Capabilities(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetDot11Status(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__ScanAvailableDot11Networks(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetSystemUris(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__StartFirmwareUpgrade(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__StartSystemRestore(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetServices_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetServiceCapabilities_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetDeviceInformation_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetSystemDateAndTime_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetSystemDateAndTime_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetSystemFactoryDefault_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__UpgradeSystemFirmware_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SystemReboot_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__RestoreSystem_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetSystemBackup_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetSystemLog_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetSystemSupportInformation_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetScopes_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetScopes_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__AddScopes_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__RemoveScopes_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetDiscoveryMode_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetDiscoveryMode_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetRemoteDiscoveryMode_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetRemoteDiscoveryMode_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetDPAddresses_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetEndpointReference_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetRemoteUser_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetRemoteUser_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetUsers_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__CreateUsers_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__DeleteUsers_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetUser_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetWsdlUrl_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetCapabilities_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetDPAddresses_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetHostname_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetHostname_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetHostnameFromDHCP_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetDNS_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetDNS_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetNTP_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetNTP_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetDynamicDNS_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetDynamicDNS_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetNetworkInterfaces_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetNetworkInterfaces_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetNetworkProtocols_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetNetworkProtocols_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetNetworkDefaultGateway_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetNetworkDefaultGateway_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetZeroConfiguration_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetZeroConfiguration_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetIPAddressFilter_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetIPAddressFilter_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__AddIPAddressFilter_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__RemoveIPAddressFilter_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetAccessPolicy_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetAccessPolicy_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__CreateCertificate_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetCertificates_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetCertificatesStatus_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetCertificatesStatus_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__DeleteCertificates_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetPkcs10Request_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__LoadCertificates_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetClientCertificateMode_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetClientCertificateMode_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetRelayOutputs_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetRelayOutputSettings_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetRelayOutputState_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SendAuxiliaryCommand_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetCACertificates_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__LoadCertificateWithPrivateKey_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetCertificateInformation_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__LoadCACertificates_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__CreateDot1XConfiguration_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__SetDot1XConfiguration_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetDot1XConfiguration_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetDot1XConfigurations_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__DeleteDot1XConfiguration_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetDot11Capabilities_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetDot11Status_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__ScanAvailableDot11Networks_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__GetSystemUris_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__StartFirmwareUpgrade_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tds__StartSystemRestore_(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__timg10__GetImagingSettings(void *_pThis);
/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__timg10__SetImagingSettings(void *_pThis);
/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__timg10__GetOptions(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__timg10__Move(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__timg10__Stop(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__timg10__GetStatus(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__timg10__GetMoveOptions(void *_pThis);
/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__timg20__GetServiceCapabilities(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__timg20__GetImagingSettings(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__timg20__SetImagingSettings(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__timg20__GetOptions(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__timg20__Move(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__timg20__Stop(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__timg20__GetStatus(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__timg20__GetMoveOptions(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__GetServiceCapabilities(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__GetRelayOutputOptions(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__GetAudioSources(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__GetAudioOutputs(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__GetVideoSources(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__GetVideoOutputs(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__GetVideoSourceConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__GetVideoOutputConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__GetAudioSourceConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__GetAudioOutputConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__SetVideoSourceConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__SetVideoOutputConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__SetAudioSourceConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__SetAudioOutputConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__GetVideoSourceConfigurationOptions(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__GetVideoOutputConfigurationOptions(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__GetAudioSourceConfigurationOptions(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__GetAudioOutputConfigurationOptions(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__GetRelayOutputs(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__SetRelayOutputSettings(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tmd__SetRelayOutputState(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__GetServiceCapabilities(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__GetConfigurations(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__GetPresets(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__SetPreset(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__RemovePreset(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__GotoPreset(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__GetStatus(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__GetConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__GetNodes(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__GetNode(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__SetConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__GetConfigurationOptions(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__GotoHomePosition(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__SetHomePosition(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__ContinuousMove(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__RelativeMove(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__SendAuxiliaryCommand(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__AbsoluteMove(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__tptz20__Stop(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetServiceCapabilities(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetVideoSources(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetAudioSources(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetAudioOutputs(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__CreateProfile(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetProfile(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetProfiles(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__AddVideoEncoderConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__AddVideoSourceConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__AddAudioEncoderConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__AddAudioSourceConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__AddPTZConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__AddVideoAnalyticsConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__AddMetadataConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__AddAudioOutputConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__AddAudioDecoderConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__RemoveVideoEncoderConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__RemoveVideoSourceConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__RemoveAudioEncoderConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__RemoveAudioSourceConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__RemovePTZConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__RemoveVideoAnalyticsConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__RemoveMetadataConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__RemoveAudioOutputConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__RemoveAudioDecoderConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__DeleteProfile(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetVideoSourceConfigurations(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetVideoEncoderConfigurations(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetAudioSourceConfigurations(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetAudioEncoderConfigurations(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetVideoAnalyticsConfigurations(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetMetadataConfigurations(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetAudioOutputConfigurations(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetAudioDecoderConfigurations(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetVideoSourceConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetVideoEncoderConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetAudioSourceConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetAudioEncoderConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetVideoAnalyticsConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetMetadataConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetAudioOutputConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetAudioDecoderConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetCompatibleVideoEncoderConfigurations(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetCompatibleVideoSourceConfigurations(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetCompatibleAudioEncoderConfigurations(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetCompatibleAudioSourceConfigurations(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetCompatibleVideoAnalyticsConfigurations(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetCompatibleMetadataConfigurations(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetCompatibleAudioOutputConfigurations(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetCompatibleAudioDecoderConfigurations(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__SetVideoSourceConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__SetVideoEncoderConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__SetAudioSourceConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__SetAudioEncoderConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__SetVideoAnalyticsConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__SetMetadataConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__SetAudioOutputConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__SetAudioDecoderConfiguration(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetVideoSourceConfigurationOptions(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetVideoEncoderConfigurationOptions(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetAudioSourceConfigurationOptions(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetAudioEncoderConfigurationOptions(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetMetadataConfigurationOptions(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetAudioOutputConfigurationOptions(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetAudioDecoderConfigurationOptions(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetGuaranteedNumberOfVideoEncoderInstances(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetStreamUri(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__StartMulticastStreaming(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__StopMulticastStreaming(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__SetSynchronizationPoint(void *_pThis);

/**************************************************
*功能:		初始化全局变量对应的结构体
*参数:		_pThis:		全局变量 g_stOnvifCtrl
*返回值:	0: 成功, !0: 失败
*修改历史: 20120224 v1.0 creat by xxx
**************************************************/
int GMemInit__trt__GetSnapshotUri(void *_pThis);

#endif
